docs/keys/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="utf-8"/>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes"/>
  
  <link rel="stylesheet" href="/intangiblesite.min.6f3d05d4bdac0307f1633386c3a19012b885aaf74e6aa41b4d30993ee220997b.css">
  <link rel="stylesheet" href="/katex.min.css"/>
  <script defer src="/katex.min.js"></script>
  <script defer src="/auto-render.min.js" onload="renderMathInElement(document.body);"></script>
</head>

<header>
  <div class="container">
    <nav>
      <ul>
        <a href="/about/">About</a></li>
        <a href="/contact">Contact</a></li>
        <a href="/keys/">Keys</a></li>
      </ul>
    </nav>
  </div>
</header>


<main>
    <h1>
        Identity Keys
    </h1>

    <article>
        
<div id="outline-container-age" class="outline-2">
<h2 id="age">
Age
</h2>
<div id="outline-text-age" class="outline-text-2">
<ul>
<li>
<p><code class="verbatim">age1hqwq0yp3stqxqmwe79vl2m3fv438xpealxsd7ehdeg2mhkvgqshqfgee7x</code></p>
</li>
</ul>
</div>
</div>
<div id="outline-container-minisign" class="outline-2">
<h2 id="minisign">
Minisign/Signify
</h2>
<div id="outline-text-minisign" class="outline-text-2">
<ul>
<li>
<p><code class="verbatim">RWQK6C+naHpMTM59i6ajFKD8JXYpPE2lDN+GKWR/2xLNrEJ5GP5nWfoa</code></p>
</li>
</ul>
</div>
</div>
<div id="outline-container-pgp" class="outline-2">
<h2 id="pgp">
PGP
</h2>
<div id="outline-text-pgp" class="outline-text-2">
<p>
<em><strong><strong>Don&#39;t use PGP for securing communications.</strong></strong></em></p>
<ul>
<li>
<p><a href="https://latacora.micro.blog/2019/07/16/the-pgp-problem.html">It is bad and outdated as a platform.</a></p>
</li>
<li>
<p><a href="https://twitter.com/FiloSottile/status/1355194247482384392">It refuses to follow proper development practices.</a></p>
</li>
<li>
<p><a href="https://efail.de/">It is a gun that automatically points to your gun for no benefit.</a></p>
</li>
</ul>
<p>However it is the only way to sign git commits. As a result I will have a single sign-only key
that will <em>not</em> be uploaded to a keypool.</p>
<ul>
<li>
<p><a href="/keys/aydinmercan.pgp">Ed25519 Public key</a></p>
</li>
</ul>
</div>
</div>

    </article>
</main>

<footer>
    <p>
    All information on this blog, unless otherwise noted, is
    hereby released into the public domain, with no rights
    reserved.
    </p>
</footer>

